In [2]:
import pandas as pd
import numpy as np

In [3]:
titanic = pd.read_csv('../datasets/Titanic.csv')
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

**Survived**: 1 (survived) | 0 (not survived).  
**Pclass**: Passenger class (1 = first, 2 = second , 3 = third).  
**Name**: Nombre del pasajero (Unique).  
**Sex**: Passenger sex  
**Age**: Passenger sex  
**SibSp**: Quantity of siblings or spouse on Titanic.  
**Parch**: Quantity of parents of sons on Titanic.  
**Ticket**: Ticket number (Unique).  
**Fare**: Passenger fare.  
**Cabin**: Cabin number (Unique).  
**Embarked**: Passenger port (C = Cherbourg, Q = Queenstown, S = Southampton).

### 1) How many females and males survived  
return a tuble of integer numbers (females, males)

In [13]:
(
 titanic[(titanic['Sex'] == 'female') & (titanic['Survived'] == 1) ].Sex.count()   ,  
 titanic[(titanic['Sex'] == 'male') & (titanic['Survived'] == 1)].Sex.count()
)

(383, 109)

In [14]:
 # """ 1 """
titanic = pd.read_csv(r'https://raw.githubusercontent.com/andrsGutirrz/datathonDatasets/master/Titanic.csv')
maleFilter = titanic["Sex"] == "male"
males = titanic.where(maleFilter)
males.dropna(inplace=True)

femaleFilter = titanic["Sex"] == "female"
females = titanic.where(femaleFilter)
females.dropna(inplace=True)

tup = (males["Survived"].count(), females["Survived"].count())
tup

(138, 132)

In [40]:
df = titanic.iloc[100:110]
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
100,102,0,3,"Petroff, Mr. Pastcho (""Pentcho"")",male,NaN,0,0,349215,7.8958,NaN,S
101,103,0,1,"White, Mr. Richard Frasar",male,21.0,0,1,35281,77.2875,D26,S
102,104,0,3,"Johansson, Mr. Gustaf Joel",male,33.0,0,0,7540,8.6542,NaN,S
103,105,0,3,"Gustafsson, Mr. Anders Vilhelm",male,37.0,2,0,3101276,7.9250,NaN,S
104,106,0,3,"Mionoff, Mr. Stoytcho",male,28.0,0,0,349207,7.8958,NaN,S
105,107,1,3,"Salkjelsvik, Miss. Anna Kristine",female,21.0,0,0,343120,7.6500,NaN,S
106,108,1,3,"Moss, Mr. Albert Johan",male,NaN,0,0,312991,7.7750,NaN,S
107,109,0,3,"Rekic, Mr. Tido",male,38.0,0,0,349249,7.8958,NaN,S
108,110,1,3,"Moran, Miss. Bertha",female,NaN,1,0,371110,24.1500,NaN,Q
109,111,0,1,"Porter, Mr. Walter Chamberlain",male,47.0,0,0,110465,52.0000,C110,S

In [41]:
maleFilter = df["Sex"] == "male"
males = df.where(maleFilter)
males.dropna(inplace=True)

femaleFilter = df["Sex"] == "female"
females = df.where(femaleFilter)
females.dropna(inplace=True)

tup = (males["Survived"].sum(), females["Survived"].sum())
tup

(0.0, 0.0)

In [42]:
males

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
101,103.0,0.0,1.0,"White, Mr. Richard Frasar",male,21.0,0.0,1.0,35281,77.2875,D26,S
109,111.0,0.0,1.0,"Porter, Mr. Walter Chamberlain",male,47.0,0.0,0.0,110465,52.0000,C110,S

In [28]:
(
 df[(df['Sex'] == 'female') & (df['Survived'] == 1) ].Sex.count()   ,  
 df[(df['Sex'] == 'male') & (df['Survived'] == 1)].Sex.count()
)

(2, 1)

In [31]:
titanic['Survived'].unique()

array([0, 1], dtype=int64)

### 2) Percentage of survival by class  
return dataframe with the following parts  
columns = ['class', 'quantity', 'percentage']
index =  range(0, n)  
dtype = Object  
percetage = 0.nnnnnn

In [5]:
s = titanic['Pclass'].value_counts().sort_index()
df = pd.DataFrame(s)
df['percentage'] = df['Pclass']/df['Pclass'].sum()
df.reset_index(inplace=True)
df.columns = ['class', 'quantity','percentage']
df

   class  quantity  percentage
0      1       321    0.245601
1      2       277    0.211936
2      3       709    0.542464

In [6]:
df.shape

(3, 3)

### 3) Average age of not survivals  
return an integer number, the 'the smallest integer greater than or equal to x' (ceil function)

In [92]:
import math
math.ceil(titanic[titanic['Survived'] == 0]['Age'].mean())

31

### 4) How many survivors had Siblings or a couple  
return an integer number

In [105]:
r, _ = titanic[(titanic['Survived'] == 1) & (titanic['SibSp'] == 1)].shape
r

166

### 5) From what place most of not survivors came from  
return a character of the port

In [144]:
not_survived = titanic[titanic['Survived'] == 0]
not_survived['Embarked'].value_counts().idxmax()

'S'

### 6) Who had the cheaper ticket and where those people come from  
return a tuple with sorted() list of names and character of the port  
([  ],'  ')

In [7]:
l = sorted(titanic[titanic['Fare'] == titanic['Fare'].min()]['Name'].tolist())

In [8]:
c= titanic[titanic['Fare'] == titanic['Fare'].min()]['Embarked'].all()

In [9]:
(l,c)

(['Andrews, Mr. Thomas Jr',
  'Campbell, Mr. William',
  'Chisholm, Mr. Roderick Robert Crispin',
  'Cunningham, Mr. Alfred Fleming',
  'Frost, Mr. Anthony Wood "Archie"',
  'Fry, Mr. Richard',
  'Harrison, Mr. William',
  'Ismay, Mr. Joseph Bruce',
  'Johnson, Mr. Alfred',
  'Johnson, Mr. William Cahoone Jr',
  'Knight, Mr. Robert J',
  'Leonard, Mr. Lionel',
  'Parkes, Mr. Francis "Frank"',
  'Parr, Mr. William Henry Marsh',
  'Reuchlin, Jonkheer. John George',
  'Tornquist, Mr. William Henry',
  'Watson, Mr. Ennis Hastings'],
 'S')

In [10]:
len(l)

17